IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G1_EPWM23_CONTROLSS_G1_EPWM23.xml
	<register id="CONTROLSS_G1_EPWM23_DCTRIPSEL" acronym="CONTROLSS_G1_EPWM23_DCTRIPSEL" offset="0x180" width="16" description="Digital Compare Trip Select Register">
		<bitfield id="DCBLCOMPSEL" width="4" begin="15" end="12" resetval="0x0" description="Digital Compare B Low Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by DCBLTRIPSEL register ORed together]" range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="DCBHCOMPSEL" width="4" begin="11" end="8" resetval="0x0" description="Digital Compare B High Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by DCBHTRIPSEL register ORed together]" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="DCALCOMPSEL" width="4" begin="7" end="4" resetval="0x0" description="Digital Compare A Low Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by DCALTRIPSEL register ORed together]" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="DCAHCOMPSEL" width="4" begin="3" end="0" resetval="0x0" description="Digital Compare A High Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by DCAHTRIPSEL register ORed together]" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM23_DCACTL" acronym="CONTROLSS_G1_EPWM23_DCACTL" offset="0x186" width="16" description="Digital Compare A Control Register">
		<bitfield id="EVT2LAT" width="1" begin="15" end="15" resetval="0x0" description="Indicates the status of DCAEVT2LAT signal.   0  The DCAEVT2LAT latch is cleared.   1  The DCAEVT2LAT latch is set." range="15" rwaccess="R"/> 
		<bitfield id="EVT2LATCLRSEL" width="2" begin="14" end="13" resetval="0x0" description="DCAEVT2 Latched clear source select: 00 CNT_ZERO event clears DCAEVT2 latch. 01 PRD_EQ event clears DCAEVT2 latch. 10          CNT_ZERO event or PRD_EQ event clears DCAEVT2 latch. 11          Reserved." range="14 - 13" rwaccess="R/W"/> 
		<bitfield id="EVT2LATSEL" width="1" begin="12" end="12" resetval="0x0" description="DCAEVT2 Latched signal select: 0 Does not select the DCAEVT2 latched signal [Refer figure Modifications to DCAEVT1.force/DCAEVT2.force generation.]     as source of DCAEVT2.force. 1 Selects the DCAEVT2 latched signal as source of DCAEVT2.force." range="12" rwaccess="R/W"/> 
		<bitfield id="EVT2FRCSYNCSEL" width="1" begin="9" end="9" resetval="0x0" description="DCAEVT2 Force Synchronization Signal Select  0: Source is synchronized with EPWMCLK 1: Source is passed through asynchronously" range="9" rwaccess="R/W"/> 
		<bitfield id="EVT2SRCSEL" width="1" begin="8" end="8" resetval="0x0" description="DCAEVT2 Source Signal Select   0: Source Is DCAEVT2 Signal  1: Source Is DCEVTFILT Signal" range="8" rwaccess="R/W"/> 
		<bitfield id="EVT1LAT" width="1" begin="7" end="7" resetval="0x0" description="Indicates the status of DCAEVT1LAT signal.   0  The DCAEVT1LAT latch is cleared.   1  The DCAEVT1LAT latch is set." range="7" rwaccess="R"/> 
		<bitfield id="EVT1LATCLRSEL" width="2" begin="6" end="5" resetval="0x0" description="DCAEVT1 Latched clear source select: 00 CNT_ZERO event clears DCAEVT1 latch. 01 PRD_EQ event clears DCAEVT1 latch. 10          CNT_ZERO event or PRD_EQ event clears DCAEVT1 latch. 11          Reserved." range="6 - 5" rwaccess="R/W"/> 
		<bitfield id="EVT1LATSEL" width="1" begin="4" end="4" resetval="0x0" description="DCAEVT1 Latched signal select: 0 Does not select the DCAEVT1 latched signal [Refer figure Modifications to DCAEVT1.force/DCAEVT2.force generation.]  as source of DCAEVT1.force. 1 Selects the DCAEVT1 latched signal as source of DCAEVT1.force." range="4" rwaccess="R/W"/> 
		<bitfield id="EVT1SYNCE" width="1" begin="3" end="3" resetval="0x0" description="DCAEVT1 SYNC, Enable/Disable   0: SYNC Generation Disabled  1: SYNC Generation Enabled" range="3" rwaccess="R/W"/> 
		<bitfield id="EVT1SOCE" width="1" begin="2" end="2" resetval="0x0" description="DCAEVT1 SOC, Enable/Disable   0: SOC Generation Disabled  1: SOC Generation Enabled" range="2" rwaccess="R/W"/> 
		<bitfield id="EVT1FRCSYNCSEL" width="1" begin="1" end="1" resetval="0x0" description="DCAEVT1 Force Synchronization Signal Select  0: Source is synchronized with EPWMCLK 1: Source is passed through asynchronously" range="1" rwaccess="R/W"/> 
		<bitfield id="EVT1SRCSEL" width="1" begin="0" end="0" resetval="0x0" description="DCAEVT1 Source Signal Select   0: Source Is DCAEVT1 Signal  1: Source Is DCEVTFILT Signal" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM23_DCBCTL" acronym="CONTROLSS_G1_EPWM23_DCBCTL" offset="0x188" width="16" description="Digital Compare B Control Register">
		<bitfield id="EVT2LAT" width="1" begin="15" end="15" resetval="0x0" description="Indicates the status of DCBEVT2LAT signal.   0  The DCBEVT2LAT latch is cleared.   1  The DCBEVT2LAT latch is set." range="15" rwaccess="R"/> 
		<bitfield id="EVT2LATCLRSEL" width="2" begin="14" end="13" resetval="0x0" description="DCBEVT2 Latched clear source select: 00 CNT_ZERO event clears DCBEVT2 latch. 01 PRD_EQ event clears DCBEVT2 latch. 10          CNT_ZERO event or PRD_EQ event clears DCBEVT2 latch. 11          Reserved." range="14 - 13" rwaccess="R/W"/> 
		<bitfield id="EVT2LATSEL" width="1" begin="12" end="12" resetval="0x0" description="DCBEVT2 Latched signal select: 0 Does not select the DCBEVT2 latched signal [Refer figure Modifications to DCBEVT1.force/DCBEVT2.force generation.]     as source of DCBEVT2.force. 1 Selects the DCBEVT2 latched signal as source of DCBEVT2.force." range="12" rwaccess="R/W"/> 
		<bitfield id="EVT2FRCSYNCSEL" width="1" begin="9" end="9" resetval="0x0" description="DCBEVT2 Force Synchronization Signal Select  0: Source is synchronized with EPWMCLK 1: Source is passed through asynchronously" range="9" rwaccess="R/W"/> 
		<bitfield id="EVT2SRCSEL" width="1" begin="8" end="8" resetval="0x0" description="DCBEVT2 Source Signal Select   0: Source Is DCBEVT2 Signal  1: Source Is DCEVTFILT Signal" range="8" rwaccess="R/W"/> 
		<bitfield id="EVT1LAT" width="1" begin="7" end="7" resetval="0x0" description="Indicates the status of DCBEVT1LAT signal.   0  The DCBEVT1LAT latch is cleared.   1  The DCBEVT1LAT latch is set." range="7" rwaccess="R"/> 
		<bitfield id="EVT1LATCLRSEL" width="2" begin="6" end="5" resetval="0x0" description="DCBEVT1 Latched clear source select: 00 CNT_ZERO event clears DCBEVT1 latch. 01 PRD_EQ event clears DCBEVT1 latch. 10          CNT_ZERO event or PRD_EQ event clears DCBEVT1 latch. 11          Reserved." range="6 - 5" rwaccess="R/W"/> 
		<bitfield id="EVT1LATSEL" width="1" begin="4" end="4" resetval="0x0" description="DCBEVT1 Latched signal select: 0 Does not select the DCBEVT1 latched signal [Refer figure Modifications to DCBEVT1.force/DCBEVT2.force generation.]  as source of DCBEVT1.force. 1 Selects the DCBEVT1 latched signal as source of DCBEVT1.force." range="4" rwaccess="R/W"/> 
		<bitfield id="EVT1SYNCE" width="1" begin="3" end="3" resetval="0x0" description="DCBEVT1 SYNC, Enable/Disable   0: SYNC Generation Disabled  1: SYNC Generation Enabled" range="3" rwaccess="R/W"/> 
		<bitfield id="EVT1SOCE" width="1" begin="2" end="2" resetval="0x0" description="DCBEVT1 SOC, Enable/Disable   0: SOC Generation Disabled  1: SOC Generation Enabled" range="2" rwaccess="R/W"/> 
		<bitfield id="EVT1FRCSYNCSEL" width="1" begin="1" end="1" resetval="0x0" description="DCBEVT1 Force Synchronization Signal Select  0: Source is synchronized with EPWMCLK 1: Source is passed through asynchronously" range="1" rwaccess="R/W"/> 
		<bitfield id="EVT1SRCSEL" width="1" begin="0" end="0" resetval="0x0" description="DCBEVT1 Source Signal Select   0: Source Is DCBEVT1 Signal  1: Source Is DCEVTFILT Signal" range="0" rwaccess="R/W"/>
	</register>
